read_verilog -sv -formal -overwrite {workspace}/fifo.v
design -reset-vlog; proc;
write_json {workspace}/netlist/sync_gray.json